#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
	* Проверка видимости элемента
		Если элемент формы с именем "Company" отсутствует на форме Тогда
			И я нажимаю кнопку выбора у поля с именем "Company"
		И я нажимаю кнопку выбора у поля с именем "PriceType"
	* Сверка с макетами, когда не совпадают строки
		
		Если Табличный документ "ИмяРеквизита" равен макету "ИмяМакета1" Тогда
		ИначеЕсли Табличный документ "ИмяРеквизита" равен макету "ИмяМакета2" Тогда
		Иначе
			Тогда я вызываю исключение "Макет не совпал с эталоном"

	* Проверка в разном окружении
		Если это Linux Тогда
		Если это web клиент Тогда

	* Стабилизация тестов
		Если появилось окно с заголовком "Соглашение (создание)" в течение 10 секунд Тогда
			И я закрываю окно с заголовком "Соглашение (создание)"

	* При создании первоначальных настроек
